#include <stdio.h>
#include "كاموس.h"

نومبور اوتام() {
    نومبور نومبور_بولت;
    چيتق("سيلا ماسوقکن سبواه نومبور بولت: ");
    ايمبس("%d", &نومبور_بولت);
    
    کالاو (نومبور_بولت == 3) {
        چيتق("%d\n", نومبور_بولت);
    } اتاو کالاو (نومبور_بولت % 2 == 0) {
        چيتق("%d اياله ݢنڤ!\n", نومبور_بولت);
    } اتاو {
        نومبور i = 0;
        سلاݢي (i < نومبور_بولت) {
            چيتق("%d اياله ݢنجيل!\n", نومبور_بولت);
            i++;
        }
    }

    اونتوق (نومبور j = 0; j < نومبور_بولت; j++) {
        چيتق("%d\n", j);
    }
    
    ڤولڠ 0;
}